#+AUTHOR: Zheng Zhicheng(ZZC)
#+DECSRIPTION: Doom emacs config
#+STARTUP: overview

** org-jira
#+BEGIN_SRC emacs-lisp
(after! org-jira
  (setq org-jira-working-dir "~/Documents/org/jira/")
  (setq jiralib-url "https://jira.vni.agileci.conti.de")
  (setq jiralib-token
    (cons "Authorization"
      (concat "Bearer " (auth-source-pick-first-password
			 :host "jira.vni.agileci.conti.de"))))
  (setq org-jira-use-status-as-todo nil)
  (setq org-jira-jira-status-to-org-keyword-alist
   '(("Working" . "STRT")
     ("New" . "TODO")
     ("Ready" . "TODO")
     ("Closed" . "DONE")
     ("Verifying" . "STRT"))))
#+END_SRC

#+RESULTS:
: ((Working . STRT) (New . TODO) (Ready . TODO) (Closed . DONE) (Verifying . STRT))

